https://www.youtube.com/watch?v=0uBirYFhizE

In [1]:
import pandas as pd

In [2]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [17]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [23]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

Method 1

In [24]:
ufo.rename(columns = {'color reported':'colors_reported', 'shape Reported':'shape_reported'}, inplace=True)

In [25]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

Method 2

In [29]:
ufo_cols = ['city', 'color_reported', 'shape_eported', 'state','time']

In [30]:
ufo.columns = ufo_cols

In [31]:
ufo.head()

                   city color_reported shape_eported state             time
0                Ithaca            NaN      TRIANGLE    NY   6/1/1930 22:00
1           Willingboro            NaN         OTHER    NJ  6/30/1930 20:00
2               Holyoke            NaN          OVAL    CO  2/15/1931 14:00
3               Abilene            NaN          DISK    KS   6/1/1931 13:00
4  New York Worlds Fair            NaN         LIGHT    NY  4/18/1933 19:00

Method 3

In [33]:
ufo = pd.read_csv('http://bit.ly/uforeports', names=ufo_cols, header=0)

In [34]:
ufo.head()

                   city color_reported shape_eported state             time
0                Ithaca            NaN      TRIANGLE    NY   6/1/1930 22:00
1           Willingboro            NaN         OTHER    NJ  6/30/1930 20:00
2               Holyoke            NaN          OVAL    CO  2/15/1931 14:00
3               Abilene            NaN          DISK    KS   6/1/1931 13:00
4  New York Worlds Fair            NaN         LIGHT    NY  4/18/1933 19:00

Method 4 do it all at the same time

In [35]:
ufo.columns = ufo.columns.str.replace(' ', '_')

In [36]:
ufo.columns

Index(['city', 'color_reported', 'shape_eported', 'state', 'time'], dtype='object')